In [4]:
#Count duplicate rows in a column 
import pandas as pd
#lets read a dataset of movie reviewers
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users= pd.read_table('http://bit.ly/movieusers', sep = '|', names = user_cols, index_col = 'user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [5]:
users.shape

(943, 4)

In [6]:
#identify duplicate zip codes
users.zip_code.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [7]:
#how many are they, duplicates?
users.zip_code.duplicated().sum()

148

In [8]:
#we lookedfor duplicates in series
#letslook at duplicates in a whole as a dataframe
users.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [9]:
users.duplicated().sum()

7

In [10]:
#hence there are 7 rows that are duplicated
#letslook at those 7 rows and see how they look like
users.loc[users.duplicated(), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [ ]:
#lets look at the parameter keep
users.loc[users.duplicated(keep = 'first'), :]
#mark duplicates as true except the first occurence
#the first occurence is kept and all other data in dataframe are identified as duplicates
#keep = False

In [11]:
users.loc[users.duplicated(keep = False), :]
#markall duplicates as true and will show all duplicates

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [12]:
#above, age 17 with zipcode 60402is alo found down the line

#now we want to drop duplicates from dataframe
users.drop_duplicates(keep = 'first').shape

(936, 4)

In [ ]:
#earlier there were 943 rows
#nowits 936 rows
#lost 7 rows

#keep = last
#keeps duplicate rows that are different (and keeps the last version of duplicates)from keep = first 

#keep = false
#it willl keep both the above versions bringing it to 929 rows

In [14]:
#Scenario, identiifying certain columns when duplicate rows are there
#lets takeage and zip code 
users.duplicated(subset = ['age', 'zip_code']).sum()

16

In [ ]:
#this means in the columns, there are totoal16 duplicates